# Referenties

Altijd beginnen met 'getting started':

https://pandas.pydata.org/docs/getting_started/index.html#getting-started

Dan een snel overzicht:

https://pandas.pydata.org/docs/user_guide/10min.html

Daarna kijken naar de API beschrijving:

https://pandas.pydata.org/docs/reference/index.html

# Installatie

Run `pip3 install pandas` in the terminal to install the Pandas library.

# Imports

In [1]:
import pandas as pd

import matplotlib.pyplot as plt

# Schetsen

In [51]:
# Dataframe maken
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [
            22,
            35,
            58
        ],
        "Sex": [
            "male",
            "male",
            "female"
        ],
    }
)

# Standaard print
print(df)

# Vergelijk met
display(df)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [22]:
# Data opslaan
df.to_csv("./persons.csv", header = True, index = False)

In [23]:
# Data inlezen
df_saved = pd.read_csv("./persons.csv")
display(df_saved)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [34]:
# De kolomnaam
df.columns

Index(['Name', 'Age', 'Sex'], dtype='object')

In [37]:
# Een kolom lezen
display(df["Age"])
display(df.Age)

type(df["Age"])

0    22
1    35
2    58
Name: Age, dtype: int64

0    22
1    35
2    58
Name: Age, dtype: int64

pandas.core.series.Series

In [54]:
# Een kolom verwijderen met .pop()
# origineel niet aanpassen? maak een .copy()
df_copy = df.copy()

# met de .pop() functie kan je het gepopte item opslaan.
col = df_copy.pop('Age')

# origineel:
display(df)

# copy - column:
display(df_copy)

# popped item:
display(col)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

                       Name     Sex
0   Braund, Mr. Owen Harris    male
1  Allen, Mr. William Henry    male
2  Bonnell, Miss. Elizabeth  female

0    22
1    35
2    58
Name: Age, dtype: int64

In [57]:
# Een kolom verwijderen met .drop()
# origineel niet aanpassen? maak een .copy()
df_copy2 = df.copy()

# .drop() het item om te removen. LET OP: standaart axis=0 (index) dus voor een column: axis = 1
df_copy2.drop("Age", axis=1, inplace=True)

#
display(df_copy2)

                       Name     Sex
0   Braund, Mr. Owen Harris    male
1  Allen, Mr. William Henry    male
2  Bonnell, Miss. Elizabeth  female

In [65]:
# Een rij lezen
# gebruik .iloc[] om de index te vinden. gebruik .loc[] om op "lables" te zoeken.
display(df.loc[0])
display(df.iloc[0][1])

Name    Braund, Mr. Owen Harris
Age                          22
Sex                        male
Name: 0, dtype: object

22

In [67]:
# Functie getRow() maken
def getRow(dataframe, index):
    return dataframe.iloc[index]

getRow(df, 2)

Name    Bonnell, Miss. Elizabeth
Age                           58
Sex                       female
Name: 2, dtype: object

In [70]:
# Een rij toevoegen
df_copy3 = df.copy()

df_copy3.loc[3] = ["Nils", 30, "male"]
df_copy3.loc[0.5] = ["Kayleigh", 26, "female"]

df_copy3 = df_copy3.sort_index().reset_index(drop=True)

display(df_copy3)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1                  Kayleigh   26  female
2  Allen, Mr. William Henry   35    male
3  Bonnell, Miss. Elizabeth   58  female
4                      Nils   30    male

In [133]:
# Functie insertAt(row, index)
#...

In [134]:
# Verkennen
# ...

In [75]:
# Filteren
# filter op alle mannen die ouder zijn dan 30:
df.query("Age > 30 and Sex == 'male'")

# zoek op mevrouw 'Bonnell, Miss. Elizabeth'

df.query("Name == 'Bonnell, Miss. Elizabeth'")

                       Name  Age     Sex
2  Bonnell, Miss. Elizabeth   58  female

In [78]:
# filteren 2
# filter op de "Name" element die "Bonnell" bevat met .str.contains()
df[df["Name"].str.contains("Bonnell")]

                       Name  Age     Sex
2  Bonnell, Miss. Elizabeth   58  female

In [136]:
# Groeperen
# ...

In [137]:
# Extra: toepassing OOP en het bouwen van je eigen library
# ...